       FD buyer-file.

       01 BUYER-RECORD.
         03 BUYER-ID PIC 9(4) value 0.
         03 BUYER-NAME PIC X(20) value spaces.
         03 BUYER-AL1 PIC X(25) value spaces.
         03 BUYER-AL2 PIC X(25) value spaces.
         03 BUYER-AL3 PIC X(25) value spaces.
         03 BUYER-AL4 PIC X(25) value spaces.
         03 BUYER-POSTCODE PIC X(7) value spaces.
         03 BUYER-PHONE PIC x(11) value spaces.
         03 BUYER-NOTES PIC X(50) value spaces.