       select buyer-file assign
       "C:\gagodata\buyerfile.dat"

           organization indexed
           access dynamic
           file status file-status
           record key is BUYER-ID OF BUYER-RECORD.
