       Function-key-setup.
           Move 0 to first-user-key
           Move 1 to user-key-setting
           move 98 to number-of-keys
           call x"AF" using set-bit-pairs
                            user-key-control
