       select property-file assign
              "C:\gagodata\propertyfile.dat"

                   organization indexed
                   access dynamic
                   file status file-status
                   record key is PROPERTY-ID OF PROPERTY-RECORD. 
