       FD seller-file.
       01 SELLER-RECORD.
         03 SELLER-ID PIC 9(4) VALUE 0.
         03 SELLER-NAME PIC X(20) value spaces.
         03 SELLER-AL1 PIC X(25) value spaces.
         03 SELLER-AL2 PIC X(25) value spaces.
         03 SELLER-AL3 PIC X(25) value spaces.
         03 SELLER-AL4 PIC X(25) value spaces.
         03 SELLER-POSTCODE PIC X(7) value spaces.
         03 SELLER-PHONE PIC X(11) value spaces.
         03 SELLER-NOTES PIC X(50) value spaces.
