       select seller-file assign
       "C:\gagodata\sellerfile.dat"

                organization indexed
                access dynamic
                file status file-status
                record key is SELLER-ID OF SELLER-RECORD.
