       FD user-file.
       01 USER-RECORD.
         03 USER-ID PIC 9(4) value 0.
         03 USER-NAME PIC X(10) value spaces.
         03 USER-PASSWORD PIC X(10) value spaces.
         03 USER-HAS-ADMIN PIC X value space.

