       select user-file assign                  
       "C:\gagodata\userfile.dat"

            organization is indexed
            access dynamic
            file status file-status
            record key is USER-ID OF USER-RECORD.
