              select viewing-file assign
              "C:\gagodata\viewingfile.dat"

                       organization indexed
                       access dynamic
                       file status file-status
                       record key is viewing-ID OF viewing-RECORD.
