       01 WS-NEXT-ID PIC 9999.
       01 file-status pic xx.

       01 id-counter pic 9999.
       01 ws-done pic 9.
         88 done value 1.

       01 MENU-IN PIC X.

       01 ws-user-has-admin pic X value spaces.
         88 is-admin value 'Y'.
